-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        8.0.33 - MySQL Community Server - GPL
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  12.0.0.6468
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- maple 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `maple` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `maple`;

-- 테이블 maple.characters 구조 내보내기
CREATE TABLE IF NOT EXISTS `characters` (
  `_id` int NOT NULL AUTO_INCREMENT,
  `u_id` int DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `job` varchar(50) DEFAULT NULL,
  `move` varchar(50) DEFAULT NULL,
  `wdate` datetime DEFAULT NULL,
  PRIMARY KEY (`_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 maple.characters:~2 rows (대략적) 내보내기
INSERT INTO `characters` (`_id`, `u_id`, `name`, `job`, `move`, `wdate`) VALUES
	(1, 1, '마카데미회귀', '바이퍼', '원점프', '2023-05-04 12:44:49'),
	(2, 1, '마카데미벤츠', '메르세데스', '메르세데스', '2023-05-04 12:44:49'),
	(3, 1, '마카데미응응', '에반', '텔포', '2023-05-04 12:44:49'),
	(4, 1, '마카데미폴맘', '아란', '쉬프트윗점프', '2023-05-04 12:44:49'),
	(5, 1, '마카데미블래', '블래스터', '쉬프트윗점프', '2023-05-04 12:44:49'),
	(6, 1, '마카데미나로', '나이트로드', '쉬프트윗점프', '2023-05-04 12:44:49');

-- 테이블 maple.moves 구조 내보내기
CREATE TABLE IF NOT EXISTS `moves` (
  `_id` int unsigned NOT NULL AUTO_INCREMENT,
  `type` varchar(50) DEFAULT NULL,
  `direction` varchar(50) DEFAULT NULL,
  `orders` int DEFAULT NULL,
  `key` varchar(50) DEFAULT NULL,
  `keydown` int DEFAULT NULL,
  `delay` float DEFAULT NULL,
  `wdate` datetime DEFAULT NULL,
  PRIMARY KEY (`_id`)
) ENGINE=InnoDB AUTO_INCREMENT=556 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 maple.moves:~59 rows (대략적) 내보내기
INSERT INTO `moves` (`_id`, `type`, `direction`, `orders`, `key`, `keydown`, `delay`, `wdate`) VALUES
	(1, '원점프', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(2, '원점프', '왼쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(3, '원점프', '왼쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(4, '원점프', '왼쪽', 4, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(5, '원점프', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(6, '원점프', '오른쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(7, '원점프', '오른쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(8, '원점프', '오른쪽', 4, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(9, '원점프', '위', 1, 'alt', 2, 0.1, '2023-05-04 16:46:03'),
	(10, '원점프', '위', 2, 'up', 1, 0, '2023-05-04 16:46:03'),
	(11, '원점프', '위', 3, 'alt', 2, 0.1, '2023-05-04 16:46:03'),
	(12, '원점프', '위', 4, 'up', 0, 1, '2023-05-04 16:46:03'),
	(13, '원점프', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(14, '원점프', '아래', 2, 'alt', 2, 0, '2023-05-04 16:46:03'),
	(15, '원점프', '아래', 3, 'down', 0, 1, '2023-05-04 16:46:03'),
	(16, '메르세데스', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(17, '메르세데스', '왼쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(18, '메르세데스', '왼쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(19, '메르세데스', '왼쪽', 4, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(20, '메르세데스', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(21, '메르세데스', '오른쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(22, '메르세데스', '오른쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(23, '메르세데스', '오른쪽', 4, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(24, '메르세데스', '위', 1, 'alt', 2, 0.1, '2023-05-04 16:46:03'),
	(25, '메르세데스', '위', 2, 'up', 1, 0, '2023-05-04 16:46:03'),
	(26, '메르세데스', '위', 3, 'alt', 2, 0.1, '2023-05-04 16:46:03'),
	(27, '메르세데스', '위', 4, 'up', 0, 0.4, '2023-05-04 16:46:03'),
	(28, '메르세데스', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(29, '메르세데스', '아래', 2, 'alt', 2, 0, '2023-05-04 16:46:03'),
	(30, '메르세데스', '아래', 3, 'down', 0, 0.4, '2023-05-04 16:46:03'),
	(31, '텔포', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(32, '텔포', '왼쪽', 2, 'shift', 2, 0.05, '2023-05-04 16:14:09'),
	(33, '텔포', '왼쪽', 3, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(34, '텔포', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(35, '텔포', '오른쪽', 2, 'shift', 2, 0.05, '2023-05-04 16:14:09'),
	(36, '텔포', '오른쪽', 3, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(37, '텔포', '위', 1, 'alt', 2, 0.2, '2023-05-04 16:46:03'),
	(38, '텔포', '위', 2, 'up', 1, 0.1, '2023-05-04 16:46:03'),
	(39, '텔포', '위', 3, 'shift', 2, 0.1, '2023-05-04 16:46:03'),
	(40, '텔포', '위', 4, 'up', 0, 0.1, '2023-05-04 16:46:03'),
	(41, '텔포', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(42, '텔포', '아래', 2, 'alt', 2, 0.2, '2023-05-04 16:46:03'),
	(43, '텔포', '아래', 3, 'shift', 2, 0.1, '2023-05-04 16:46:03'),
	(44, '텔포', '아래', 4, 'down', 0, 0.1, '2023-05-04 16:46:03'),
	(45, '쉬프트윗점프', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(46, '쉬프트윗점프', '왼쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(47, '쉬프트윗점프', '왼쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(48, '쉬프트윗점프', '왼쪽', 4, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(49, '쉬프트윗점프', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(50, '쉬프트윗점프', '오른쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(51, '쉬프트윗점프', '오른쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(52, '쉬프트윗점프', '오른쪽', 4, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(53, '쉬프트윗점프', '위', 1, 'alt', 2, 0.15, '2023-05-04 16:46:03'),
	(54, '쉬프트윗점프', '위', 2, 'up', 1, 0.1, '2023-05-04 16:46:03'),
	(55, '쉬프트윗점프', '위', 3, 'shift', 2, 0.1, '2023-05-04 16:46:03'),
	(56, '쉬프트윗점프', '위', 4, 'up', 0, 0.1, '2023-05-04 16:46:03'),
	(57, '쉬프트윗점프', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(58, '쉬프트윗점프', '아래', 2, 'alt', 2, 0, '2023-05-04 16:46:03'),
	(59, '쉬프트윗점프', '아래', 3, 'down', 0, 0.5, '2023-05-04 16:46:03');

-- 테이블 maple.skills 구조 내보내기
CREATE TABLE IF NOT EXISTS `skills` (
  `_id` int NOT NULL AUTO_INCREMENT,
  `c_id` int DEFAULT NULL,
  `key` varchar(50) DEFAULT NULL,
  `keydown` int DEFAULT NULL,
  `before` float DEFAULT NULL,
  `after` float DEFAULT NULL,
  `cooldown` float DEFAULT NULL,
  `relation` int DEFAULT '0',
  `relations_id` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT '[]',
  `relations` varchar(50) DEFAULT '[]',
  `time` varchar(50) DEFAULT 'init.time.time()',
  `memo` varchar(50) DEFAULT NULL,
  `wdate` datetime DEFAULT NULL,
  PRIMARY KEY (`_id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 maple.skills:~24 rows (대략적) 내보내기
INSERT INTO `skills` (`_id`, `c_id`, `key`, `keydown`, `before`, `after`, `cooldown`, `relation`, `relations_id`, `relations`, `time`, `memo`, `wdate`) VALUES
	(1, 1, 'f9', 0, 1, 0, 200, 0, '[]', '[]', 'init.time.time()', '펫 먹이', '2023-05-04 14:47:13'),
	(2, 1, 'home', 0, 2, 0, 60, 0, '[]', '[]', 'init.time.time()', '전함 노틸러스', '2023-05-04 14:50:37'),
	(3, 1, 'n2', 0, 2, 0, 180, 0, '[]', '[]', 'init.time.time()', '럭키 다이스', '2023-05-04 14:50:38'),
	(4, 1, 'n1', 0, 2, 0, 180, 0, '[]', '[]', 'init.time.time()', '스티뮬레이트', '2023-05-04 14:50:37'),
	(5, 1, 'shift', 0, 0.1, 0, 0, 0, '[]', '[]', 'init.time.time()', '훅 붐버', '2023-05-04 16:23:34'),
	(6, 2, 'f9', 0, 1, 0, 200, 0, '[]', '[]', 'init.time.time()', '펫 먹이', '2023-05-04 14:47:13'),
	(7, 2, 'shift', 0, 0.1, 0, 0, 0, '[8,9]', '[]', 'init.time.time()', '리프 토네이도', '2023-05-04 16:23:34'),
	(8, 2, 'delete', 0, 0.7, 0, 4, 1, '[]', '[]', 'init.time.time()', '롤링 문썰트', '2023-05-04 16:23:34'),
	(9, 2, 'end', 0, 0.7, 0, 4, 1, '[]', '[]', 'init.time.time()', '레전드리 스피어', '2023-05-04 16:23:34'),
	(10, 3, 'ctrl', 0, 0.3, 0.3, 0, 0, '[]', '[]', 'init.time.time()', '서클 오브 어스', '2023-05-04 16:23:34'),
	(11, 3, 'delete', 0, 0.5, 0.5, 10, 0, '[19,14]', '[]', 'init.time.time()', '드래곤 스위프트', '2023-05-04 16:23:34'),
	(12, 3, 'end', 0, 0.5, 0.5, 10, 0, '[18,14]', '[]', 'init.time.time()', '드래곤 다이브', '2023-05-04 16:23:34'),
	(13, 3, 'pagedown', 0, 0.5, 0.5, 10, 0, '[17,14]', '[]', 'init.time.time()', '드래곤 브레스', '2023-05-04 16:23:34'),
	(14, 3, 'a', 0, 0, 0, 0, 1, '[]', '[]', 'init.time.time()', '돌아와', '2023-05-04 16:23:34'),
	(15, 3, 'home', 0, 0.5, 1, 40, 0, '[]', '[]', 'init.time.time()', '다크포그', '2023-05-04 16:23:34'),
	(16, 3, 'n1', 0, 0.5, 1, 80, 0, '[]', '[]', 'init.time.time()', '서먼오닉스 드래곤', '2023-05-04 16:23:34'),
	(17, 3, 'ctrl', 0, 0, 1.5, 0, 1, '[]', '[]', 'init.time.time()', '연계 -서클 오브 어스', '2023-05-04 16:23:34'),
	(18, 3, 'n2', 0, 0, 1.5, 0, 1, '[]', '[]', 'init.time.time()', '연계 -서클 오브 썬더', '2023-05-04 16:23:34'),
	(19, 3, 'n3', 0, 0, 1.5, 0, 1, '[]', '[]', 'init.time.time()', '연계 -서클 오브 윈드', '2023-05-04 16:23:34'),
	(20, 4, 'ctrl', 0, 0.2, 0.3, 0, 0, '[]', '[]', 'init.time.time()', '비욘더', '2023-05-04 16:23:34'),
	(21, 4, 'n1', 0, 0.2, 0.3, 70, 0, '[]', '[]', 'init.time.time()', '아드레날린 부스트 액티베이트', '2023-05-04 16:23:34'),
	(22, 4, 'n2', 0, 0.2, 0.3, 180, 0, '[]', '[]', 'init.time.time()', '아드레날린 제너레이터', '2023-05-04 16:23:34'),
	(23, 3, 'f9', 0, 1, 0, 200, 0, '[]', '[]', 'init.time.time()', '펫 먹이', '2023-05-04 14:47:13'),
	(24, 4, 'f9', 0, 1, 0, 200, 0, '[]', '[]', 'init.time.time()', '펫 먹이', '2023-05-04 14:47:13'),
	(25, 5, 'f9', 0, 1, 0, 200, 0, '[]', '[]', 'init.time.time()', '펫 먹이', '2023-05-04 14:47:13'),
	(26, 5, 'ctrl', 0, 0.3, 0.7, 0, 0, '[]', '[]', 'init.time.time()', '콤보공격', '2023-05-04 14:47:13'),
	(27, 5, 'pagedown', 0, 0.3, 0.3, 15, 0, '[]', '[]', 'init.time.time()', '허리케인믹서', '2023-05-04 14:47:13'),
	(28, 5, 'delete', 0, 0.3, 0.7, 15, 0, '[]', '[]', 'init.time.time()', '릴리즈 파일 벙커', '2023-05-04 14:47:13'),
	(29, 5, 'n2', 0, 1, 1, 200, 0, '[]', '[]', 'init.time.time()', '슈퍼인듀어런스', '2023-05-04 14:47:13'),
	(30, 5, 'n3', 0, 1, 1, 120, 0, '[]', '[]', 'init.time.time()', '맥시마이즈 캐논', '2023-05-04 14:47:13'),
	(31, 6, 'f9', 0, 1, 0, 200, 0, '[]', '[]', 'init.time.time()', '펫 먹이', '2023-05-04 14:47:13'),
	(32, 6, 'ctrl', 0, 0.2, 0.4, 0, 0, '[]', '[]', 'init.time.time()', '쇼다운첼린지', '2023-05-04 14:47:13'),
	(33, 6, 'delete', 0, 0.3, 0.3, 30, 0, '[]', '[]', 'init.time.time()', '써든레이드', '2023-05-04 14:47:13'),
	(34, 6, 'end', 0, 1, 1, 60, 0, '[]', '[]', 'init.time.time()', '다크플레어', '2023-05-04 14:47:13'),
	(35, 6, 'n1', 0, 1, 1, 40, 0, '[]', '[]', 'init.time.time()', '퍼지에어리어', '2023-05-04 14:47:13');

-- 테이블 maple.users 구조 내보내기
CREATE TABLE IF NOT EXISTS `users` (
  `_id` int NOT NULL AUTO_INCREMENT,
  `id` varchar(50) DEFAULT NULL,
  `pw` varchar(50) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `wdate` datetime DEFAULT NULL,
  PRIMARY KEY (`_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 maple.users:~0 rows (대략적) 내보내기
INSERT INTO `users` (`_id`, `id`, `pw`, `name`, `wdate`) VALUES
	(1, 'melkin', '141215', '장동혁', '2023-05-04 11:11:49');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
