-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        8.0.33 - MySQL Community Server - GPL
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  12.0.0.6468
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- maple 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `maple` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `maple`;

-- 테이블 maple.moves 구조 내보내기
CREATE TABLE IF NOT EXISTS `moves` (
  `_id` int unsigned NOT NULL AUTO_INCREMENT,
  `type` varchar(50) DEFAULT NULL,
  `direction` varchar(50) DEFAULT NULL,
  `orders` int DEFAULT NULL,
  `key` varchar(50) DEFAULT NULL,
  `keydown` int DEFAULT NULL,
  `delay` float DEFAULT NULL,
  `wdate` datetime DEFAULT NULL,
  PRIMARY KEY (`_id`)
) ENGINE=InnoDB AUTO_INCREMENT=556 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 maple.moves:~73 rows (대략적) 내보내기
INSERT INTO `moves` (`_id`, `type`, `direction`, `orders`, `key`, `keydown`, `delay`, `wdate`) VALUES
	(1, '원점프', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(2, '원점프', '왼쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(3, '원점프', '왼쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(4, '원점프', '왼쪽', 4, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(5, '원점프', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(6, '원점프', '오른쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(7, '원점프', '오른쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(8, '원점프', '오른쪽', 4, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(9, '원점프', '위', 1, 'alt', 2, 0.2, '2023-05-04 16:46:03'),
	(10, '원점프', '위', 2, 'up', 1, 0, '2023-05-04 16:46:03'),
	(11, '원점프', '위', 3, 'alt', 2, 0.1, '2023-05-04 16:46:03'),
	(12, '원점프', '위', 4, 'up', 0, 1, '2023-05-04 16:46:03'),
	(13, '원점프', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(14, '원점프', '아래', 2, 'alt', 2, 0, '2023-05-04 16:46:03'),
	(15, '원점프', '아래', 3, 'down', 0, 1, '2023-05-04 16:46:03'),
	(16, '메르세데스', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(17, '메르세데스', '왼쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(18, '메르세데스', '왼쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(19, '메르세데스', '왼쪽', 4, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(20, '메르세데스', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(21, '메르세데스', '오른쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(22, '메르세데스', '오른쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(23, '메르세데스', '오른쪽', 4, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(24, '메르세데스', '위', 1, 'alt', 2, 0.2, '2023-05-04 16:46:03'),
	(25, '메르세데스', '위', 2, 'up', 1, 0, '2023-05-04 16:46:03'),
	(26, '메르세데스', '위', 3, 'alt', 2, 0.1, '2023-05-04 16:46:03'),
	(27, '메르세데스', '위', 4, 'up', 0, 0.4, '2023-05-04 16:46:03'),
	(28, '메르세데스', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(29, '메르세데스', '아래', 2, 'alt', 2, 0, '2023-05-04 16:46:03'),
	(30, '메르세데스', '아래', 3, 'down', 0, 0.4, '2023-05-04 16:46:03'),
	(31, '텔포', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(32, '텔포', '왼쪽', 2, 'shift', 2, 0.05, '2023-05-04 16:14:09'),
	(33, '텔포', '왼쪽', 3, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(34, '텔포', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(35, '텔포', '오른쪽', 2, 'shift', 2, 0.05, '2023-05-04 16:14:09'),
	(36, '텔포', '오른쪽', 3, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(37, '텔포', '위', 1, 'alt', 2, 0.2, '2023-05-04 16:46:03'),
	(38, '텔포', '위', 2, 'up', 1, 0.1, '2023-05-04 16:46:03'),
	(39, '텔포', '위', 3, 'shift', 2, 0.1, '2023-05-04 16:46:03'),
	(40, '텔포', '위', 4, 'up', 0, 0.1, '2023-05-04 16:46:03'),
	(41, '텔포', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(42, '텔포', '아래', 2, 'alt', 2, 0.2, '2023-05-04 16:46:03'),
	(43, '텔포', '아래', 3, 'shift', 2, 0.1, '2023-05-04 16:46:03'),
	(44, '텔포', '아래', 4, 'down', 0, 0.1, '2023-05-04 16:46:03'),
	(45, '쉬프트윗점프', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(46, '쉬프트윗점프', '왼쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(47, '쉬프트윗점프', '왼쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(48, '쉬프트윗점프', '왼쪽', 4, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(49, '쉬프트윗점프', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(50, '쉬프트윗점프', '오른쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(51, '쉬프트윗점프', '오른쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(52, '쉬프트윗점프', '오른쪽', 4, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(53, '쉬프트윗점프', '위', 1, 'alt', 2, 0.15, '2023-05-04 16:46:03'),
	(54, '쉬프트윗점프', '위', 2, 'up', 1, 0.1, '2023-05-04 16:46:03'),
	(55, '쉬프트윗점프', '위', 3, 'shift', 2, 0.1, '2023-05-04 16:46:03'),
	(56, '쉬프트윗점프', '위', 4, 'up', 0, 0.1, '2023-05-04 16:46:03'),
	(57, '쉬프트윗점프', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(58, '쉬프트윗점프', '아래', 2, 'alt', 2, 0, '2023-05-04 16:46:03'),
	(59, '쉬프트윗점프', '아래', 3, 'down', 0, 0.5, '2023-05-04 16:46:03'),
	(60, '방향키윗점', '왼쪽', 1, 'left', 1, 0, '2023-05-04 16:14:09'),
	(61, '방향키윗점', '왼쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(62, '방향키윗점', '왼쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(63, '방향키윗점', '왼쪽', 4, 'left', 0, 0.1, '2023-05-04 16:14:09'),
	(64, '방향키윗점', '오른쪽', 1, 'right', 1, 0, '2023-05-04 16:14:09'),
	(65, '방향키윗점', '오른쪽', 2, 'alt', 2, 0.05, '2023-05-04 16:14:09'),
	(66, '방향키윗점', '오른쪽', 3, 'alt', 2, 0, '2023-05-04 16:14:09'),
	(67, '방향키윗점', '오른쪽', 4, 'right', 0, 0.1, '2023-05-04 16:14:09'),
	(68, '방향키윗점', '위', 1, 'alt', 2, 0.1, '2023-05-04 16:46:03'),
	(69, '방향키윗점', '위', 2, 'up', 2, 0, '2023-05-04 16:46:03'),
	(70, '방향키윗점', '위', 3, 'up', 2, 1, '2023-05-04 16:46:03'),
	(71, '방향키윗점', '아래', 1, 'down', 1, 0.1, '2023-05-04 16:46:03'),
	(72, '방향키윗점', '아래', 2, 'alt', 2, 0, '2023-05-04 16:46:03'),
	(73, '방향키윗점', '아래', 3, 'down', 0, 1, '2023-05-04 16:46:03');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
